{
   "blogs": [
       {
           "blogTitle": "What is Veganism?",
           "blogId": 0,
           "blogImage":"../../../assets/images/Blog1.jpg",
           "content":{
               "titles":[
                   {
                       "subTitle": "What in the world is 'Veganism'?",
                       "paras": [
                           "Veganism is not just a diet to lose or gain weight, but it is a lifestyle. A lifestyle of abstinence from animal products and cruelty.",

                           "Ethical veganism comes from the International Vegetarian Union, ' Veganism may be defined as a way of living that seeks to exclude, as far as possible and practical, all forms of exploitation of, and cruelty to, animals for food, clothing, or any other purpose. In dietary terms, it refers to the practice of dispensing with all animal products, including meat, fish, poultry, eggs, animal milk, honey, and their derivatives.' ",

                           "So, we got that part pretty clear—let’s tackle the reason why the heck we're here right now."
                       ],
                       "images":[
                           "../../../assets/images/Blog1.jpg"
                           
                       ]
                    },
                    {
                        "subTitle": "Why are you here?",
                        "paras": [
                            "One of the reasons you are here is probably because you asked us about our diet and we told you to go here, secondly because you want a change for the greater good. Whether you aim to lose weight or you’re compassionate about animals and the environment, or just because you are sick and tired of your current diet—plus you’ve seen success in others through a Plant-Based Diet. But before we proceed on how we intend to achieve our goals, we must identify our motivations and ask ourselves why we are willing to make these changes in our lifestyle. For some of us, it won't be an easy task, and this is very relatable. Apparently, you are interested, otherwise you wouldn't have stuck around. So think hard about it. What are your reasons for going through with this lifestyle change? Perhaps, I can help you by sharing our little story of why we went vegan."
                        ],
                        "images":[
                            "../../../assets/images/bloglistphoto.jpg"
                        ]
                    },
                    {
                        "subTitle": "Why we went Vegan?",
                        "paras": [
                            "I suggest grabbing a banana or something before continuing, because this may take a while. Haha! It all started when a good friend, who was already vegan at that time (Shoutout Richard Visco) told me to watch this documentary “What The Health.” Frankly, I didn’t finish it. I had no interest with what’s happening in the film. Indeed, I felt pity for the animals while watching, but I closed off my mind so much so that I never got to the middle part of the documentary. This was my introduction to veganism. Months later I moved to Canada and found out that, it’s so hard to get a job! Long story short—I was broke AF. Can’t blame the system though—because I had spent so much money on Pizzas, Burgers, Bacon and Processed Meats that it obliterated my budget for food entirely. Life moments like this force you to go into survival mode and try to be as cheap as possible. So, I went with Eggs and Rice diet for a certain amount of time. All this while my vegan brother Pursharth Vohra (You can call him Paras) and I were trying to go back to the gym.",

                            "One day, I was chilling with another good friend (Shoutout Oti) while devouring a massive pack of Oreo cookies. We didn’t finish the whole box. But, before he left he asked me one more time if I wanted more and so I said “No bro, take that away from me.” because honestly, I can finish it within minutes. He then randomly suggested a health documentary on Netflix, and surprise surprise—it’s “What The Health” again! So I opened my mind to it and watched it alone before going to bed. That film killed me—with all the truths about animal farming and the dairy industry (will elaborate on the following posts). From broke AF to WOKE AF. I went to bed that night battling the decision of if I was going to ignore it or go for it. The first thing I did the next morning was to tell Paras about what I just watched and persuaded him to watch it himself. Even though he was a vegetarian(Still consume Eggs and Dairy) all his life Paras has had a condition since he was a kid, he had lumps all over his body made out of saturated fats accumulated inside his body. He went to a doctor, and the only thing the doctor said was “Change nothing and continue living your life normally.” It was obvious that there was something wrong, and something needed to be done. So, after he finished watching the film, I asked him “So what do you think?” He just said “Yeah let’s do it.” and that was the beginning of our vegan journey. I threw the milk, butter, and cheese that I still had in the fridge and luckily I was out of eggs.",
                            "I know there will be more questions after this. Like “Have you cheated on the diet?” or “is it hard to transition?” and the most classic of all “WHERE DO YOU GET YOUR PROTEINS?”. We will cover all this in the upcoming blogs, and please leave your questions or general inquiries in the comment section below to let us know what the dark-chocolate-fudge it takes to convince you. We coined the term \"Veganhood\" because we want everyone to work together as a community of brothers and sisters in pursuing our optimal health while saving this planet at the same time.",
                            "Now that we got all that covered, let’s see some tips on how to get started."
                        ],
                        "images":[
                            "path"
                        ]
                    }
               ]
           }
       },
       {
        "blogTitle": "Transitioning to veganism",
        "blogId": 1,
        "blogImage":"../../../assets/images/Blog2.jpg",
        "content":{
            "titles":[
                {
                    "subTitle":"Tips on going vegan",
                    "paras":[
                        
                    ],
                    "images":[
                        
                    ]
                },
                {
                    "subTitle": "Ask yourself “Why?”.",
                    "paras":[
                        "Did you have your reason sealed tight? Good! Whatever your reason for making this lifestyle choice make sure that this will be your drive and motivation to keep going and not fail. But, don’t worry if you fail. Get up and get back at it."
                    ],
                    "images":[
                        
                    ]
                },
                {
                    "subTitle":"Do your research.",
                    "paras":[
                        "This is probably the most important thing for you need to do when switching to this diet because VEGANS FAIL without research! The data is all around us, and it is becoming easier to access with all the available documentaries today. I strongly recommend that you watch a couple of this films. What The Health, The C Word, Cowspiracy, Forks Over Knives, Fat Sick and Nearly Dead and Earthlings. All this are available on Netflix and some are on YouTube as well."
                    ],
                    "images":[
                        
                    ]
                },
                {
                    "subTitle":"Try it with someone.",
                    "paras":[
                        "Whether it is your Mother, Father, Brother, Sister or your Dog. Try and do it with someone else so you can look after each other and do the research together."
                    ],
                    "images":[
                        "../../../assets/images/Blog2.jpg"
                    ]
                },
                {
                    "subTitle":"Learn how to cook.",
                    "paras":[
                        "This is the first thing I did after the decision to go vegan. Unfortunately, it is not easy to find somewhere to eat out on this lifestyle—but then again, you can make sure of everything going inside your body. This way you can track your health way better!"
                    ],
                    "images":[
                        
                    ]
                },
                {
                    "subTitle":"WE ALL FAIL!",
                    "paras":[
                        "Initially, we all fail. Let’s face it we love sweets and salty food or those medium rare steaks or that classic cheeseburger. Don’t sweat it. I failed too couple of times. But as I’ve told you, go to the start and ask why are you doing it in the first place, and it should do the trick of getting you back on track. Here is where a partner comes in handy too. So you have someone who can smack you every time you cheat. Haha!"
                    ],
                    "images":[
                        
                    ]
                },
                {
                    "subTitle":"Have staples in your diet.",
                    "paras":[
                        "Assess what Plant-Based foods you already like and are already a part of your diet. This way you can eliminate and add certain foods to your daily meals."
                    ],
                    "images":[
                        
                    ]
                },
                {
                    "subTitle":"NEVER LET YOURSELF BE HUNGRY!",
                    "paras":[
                        "Another thing you should always think about going into this lifestyle is—you can never be hungry. Eat foods (Plant foods) that will make you satisfied for long periods of time. Not just salads for the entire day or just veggie juices. This will not work. Get more volume of food with low fats and loads of good calories to get you going throughout the day."
                    ],
                    "images":[
                        
                    ]
                },
                {
                    "subTitle":"Listen to your body.",
                    "paras":[
                        "This is something that we usually forget. We only have one body in this life and we should take care of it. Feed it with good food and you feel good, feed it with bad food and you’ll more often than not feel bad too."
                    ],
                    "images":[
                        "../../../assets/images/plantBased.jpg"
                    ]
                },
                {
                    "subTitle":"Be proud of this lifestyle.",
                    "paras":[
                        "Because you have everything to gain and nothing to lose. Let them talk. Vegans have the longest life expectancy rate on the planet."
                    ],
                    "images":[
                        
                    ]
                },
                {
                    "subTitle":"GET YOUR ASS UP!",
                    "paras":[
                        "What’s the point of being healthy if you’re just sitting around and doing nothing. Move around and feel the energy coming from this healthy and abundant lifestyle!",
                        "Finally, I know a lot of you reading this wants some weight loss tips. So, here we go!"
                    ],
                    "images":[
                        "path"
                    ]
                },
                {
                    "subTitle":"Weight loss",
                    "paras":[
                        "There are no secrets or shortcuts to losing weight! One tip we can give you is be patient and trust the process. The only way is to track your diet and have reasonable amounts of exercise regularly. It’s evident that if you eat high volumes of food with low fat and the right amount of calories, you will be lean faster than you think. To give some away, here’s what you should eat on a plant-based diet to lose weight. CARBS! Like rice, beans, potatoes, and lentils. People will say carbs will make you fat. This is where your research comes in. We will talk about that in the following blogs—for now, ask yourself how many types \"Carbohydrates\" are there? Don’t worry about protein. All plant-based foods have protein and some more than what we need. Eat more greens. Pick the greens that you like and put them in a bowl then enjoy it. Fruits! These are very dense in water and suitable sugars to fulfill your sweet tooth. Essentially, you want to be calorie deficient to lose weight. Learn this, and you will see amazing results. As of now I challenge you to try this diet and see what happens to your body instantly. There will be withdrawal symptoms in the first week or two. This is coming from all the animal products you have consumed all your life. Once you overcome these stages, you are now going to crave more vegan foods than you expected.",

                        "So, thank you for staying with me all the way to the end. Till next time!"
                    ],
                    "images":[
                        
                    ]
                }

            ]
        }
       },
       {
            "blogTitle": "Eliminating Health Risks on Plant-Based Diet",
            "blogId": 2,
            "blogImage":"../../../assets/images/bodyTransformation.jpg",
            "content":{
                "titles":[
                    {
                        "subTitle": "Still need a little more convincing?",
                       "paras": [
                            "One of the main benefits of a vegan lifestyle is the longevity of life that it affords us by keeping us healthier than ever. Our bodies transform in amazing ways on a Plant-based diet. This fact is backed up by evidence provided in studies that we will be looking at. Several researchers and top doctors have conducted studies into the effects of our diet on the quality of our life and our body’s ability to fight and withstand diseases. Changes occur in our bodies and these will of course vary between everyone, and will depend on the lifestyle he/she had in the past.",

                            "However, research proves that a vegan diet is the healthiest diet for you—In terms of longevity. This diet has been received critical acclaim for achieving the feat of reversing some of the most deadliest diseases and leading human killers of our time. As Dr. Michael Greger put it “The side effects would be NOT having to take drugs at all”."


                       ],
                       "images":[
                            "path"
                       ]
                    },
                    {
                        "subTitle": "Let’s start, shall we?",
                       "paras": [
                            "First and foremost, let’s talk about the dangers of meat—What benefits can we get just by eliminating it completely out of our diet. The key word here is IGF-1. Yes, some here may know that these are proteins that are actually helping our muscles to grow. This is true, obviously because it is a growth hormone. Although, It is also involved in the growth and spread of every cancer across the board—which is why it is considered as group 1 carcinogen. Dropping off meat eliminates animal proteins that increases our IGF-1 levels and by eating whole foods, it immediately kills the cancer cells. This is why a whole food plant based diet is surely an easy way to reduce our problems of dying with cancer. Eating these animal proteins cause inflammations all over our bodies—that all kinds of diseases love. Link of the study will be on the reference page.",

                            "What else will happen following this lifestyle. Well, a study show that in just 3 weeks—arteries will clear up and decreases your risk of heart disease. It also results to better blood flow which means other problems caused by clogged arteries can be cured as well. To name a few more health benefits of a vegan diet: it also lowers the risks of hypertension, diabetes, cancer, hypothyroidism, Parkinson’s disease, obesity, Alzheimer’s disease, multiple sclerosis. The list goes on. Goodbye heart problems! 💔",

                            "How about dairy products? Just day 1-3 of laying off your milk and butter will take off the mammalian hormones that messes up your own hormonal system. This means you can get rid of risks on diseases caused by hormonal imbalances—in both men and women. According to the research drinking Cow’s milk dramatically increases estrone in our body, and lowers testosterone levels. This causes hypertension, hypothyroidism, etc. Moreover, consuming dairy products are correlated with some cancers involving high calcium intake. Yes, calcium is not all that good in our body when taken in excessive amounts. More on that on the future posts."
                       ],
                       "images":[
                            "../../../assets/images/bodyTransformation.jpg"
                       ]
                    },
                    {
                        "subTitle": "As promised, body transformation on a vegan diet",
                       "paras": [
                            "I’ll make this easier for you. Visit youtube and search “Unbelievable Vegan Transformations”. I can promise you right now—your brains will scatter on the floor with the results people get following this healthy and cruelty free lifestyle. From “fat to fit” to “skinny to fit”—anything is possible on a plant based diet. Vegans will tell you—they become happier transitioning into a vegan. Why is that? It is because they can see changes. Changes in both internal and external physical body. I for one can personally stand witness to how our lives changed moving into this diet. My vegan brother shredded 10kgs of excess weight and for myself, I gained 5kg already in just 4 months. We will talk about our transformation next time. For now, try considering a high carb-low fat diet. Makes sense right? You gain more energy with little to no fat. Who doesn’t want that.",

                            "How about that for convincing? Always remember, that this diet is also known as \"Eat as much as you want\" diet. Because generally you are just consuming real good food. No question, you can achieve whatever fitspiration you want! So, let’s all be a better, badder, bolder versions of ourselves shall we?",

                            "That’s it for this post, every word you read is very much appreciated. Thank you and till next time! 🙏"
                       ],
                       "images":[

                       ]
                    }

                ]
            }
        },
        {
            "blogTitle": "You are doing more than you think",
            "blogId": 3,
            "blogImage":"../../../assets/images/blog4Thum.jpg",
            "content":{
                "titles":[
                    {
                        "subTitle": "",
                       "paras": [
                            "As a Human being in this current society, you are always doing more than what you think. Everything we do is always affecting a bigger picture. Especially our dietary choices, whether you're a vegan or not. Let me explain.",
                            "Did you know that a 1/3-pound burger required 660 gallons of water to make? Crazy, right? And to think that there are many people around the world going through difficult circumstances just to have little water for the day. I imagine you didn't think that's how much water you waste a day. But don't worry, because from now on every beef burger you dodge is a win for the cows and the environment. Here's the funny thing, this is just the tip of the iceberg.",
                            "There is a vegan quote saying, 'You can't call yourself an environmentalist if you eat meat.' The fact that animal agriculture (Let's call this 'AA' because I hate this term) is the second leading cause of climate change is something we can't neglect. AA is causing 90% of rainforest deforestation and 50% of our ocean's acidification. This ultimately leads to some animal species being extinct. However, this is just some damages that we can see with our naked eye. What about greenhouse gasses which play a big role on the climate change problem our planet is facing right now?",
                            "Even if we combine all the emissions from all transportation vehicles (Land, Sea, and Air), AA is still the largest contributor of greenhouse gas in the planet. That is 1.6 billion cows releasing 100kg of Methane gas each year, and Methane is 23x stronger than CO2. Just imagine how much effort we do to lessen our carbon footprint on everyday life when we can just boycott meat. Because the fact of the matter is 95% of meat that humans consume is from AA."

                       ],
                       "images":[
                            "../../../assets/images/blog4Thum.jpg"
                       ]
                    },
                    {
                        "subTitle": "How about sustainability?",
                       "paras": [
                            "A 1.5 acre of land can produce 375 pounds of meat. Pretty good right? -- But, that's nothing compared to 37,000 pounds of plant-based products. With that kind of food production, our resources can feed 10 billion people today. With that being said, humans eat 21 billion pounds of food--compared to that 135 billion pounds of food 1.5 billion cows eat. 50% of our grains are going to the feed for meat. Also, 1/3 of our fresh water goes to animal agriculture. Meanwhile, a lot of people around the world don't have access to clean water."


                       ],
                       "images":[
                            "path"
                       ]
                    },
                    {
                        "subTitle": "So, are we right that we went plant-based?",
                       "paras": [
                            "Heck yeah, we are! Not only that we are eliminating risks on our health, we also are helping heal our environment. Because luckily methane only stays for 10 years while CO2 sticks around for 100 years--this and many more. By going vegan, you are not cutting innocent trees and polluting our oceans. By eliminating meat, we are standing our ground on protecting our precious mother earth. Thank you for joining the Veganhood. You made the right choice. Till next time!"

                       ],
                       "images":[

                       ]
                    }

                ]
            }
        }


    ]
}